# Pandas Data Frame

In [1]:
import pandas as pd

In [2]:
l=[1,2,45,7,71]

In [3]:
l

[1, 2, 45, 7, 71]

In [4]:
pd.DataFrame(l,columns=["name of variables"])

   name of variables
0                  1
1                  2
2                 45
3                  7
4                 71

In [5]:
import numpy as np
m= np.arange(1,10).reshape((3,3))
m

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [6]:
pd.DataFrame(m,columns=["var1","var2","var3"])

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

# calling of "df"

In [7]:
df= pd.DataFrame(m, columns=["var1","var2","var3"])
df

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [8]:
df.columns

Index(['var1', 'var2', 'var3'], dtype='object')

In [9]:
df.columns=("v1","v2","v3")

In [10]:
df

   v1  v2  v3
0   1   2   3
1   4   5   6
2   7   8   9

In [11]:
type(df)

pandas.core.frame.DataFrame

In [12]:
df.axes

[RangeIndex(start=0, stop=3, step=1),
 Index(['v1', 'v2', 'v3'], dtype='object')]

In [13]:
df.shape

(3, 3)

In [14]:
df.ndim

2

In [15]:
df.size

9

In [16]:
df.values

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [17]:
type(df.values)

numpy.ndarray

In [18]:
df.head()

   v1  v2  v3
0   1   2   3
1   4   5   6
2   7   8   9

In [20]:
df.head(2)

   v1  v2  v3
0   1   2   3
1   4   5   6

In [21]:
df.tail(1)

   v1  v2  v3
2   7   8   9

In [22]:
a=np.array([1,2,3,4,5])
pd.DataFrame(a,columns=["veriables"])

   veriables
0          1
1          2
2          3
3          4
4          5

In [ ]:
# dataFrame with dictonary

In [23]:
s1=np.random.randint(10,size=5)
s2=np.random.randint(10,size=5)
s3=np.random.randint(10,size=5)

In [24]:
dic={"var1":s1,"var2":s2,"var3":s3}

In [25]:
dic

{'var1': array([6, 8, 4, 6, 2]),
 'var2': array([7, 2, 4, 9, 7]),
 'var3': array([4, 0, 9, 1, 5])}

In [26]:
df=pd.DataFrame(dic)

In [27]:
df

   var1  var2  var3
0     6     7     4
1     8     2     0
2     4     4     9
3     6     9     1
4     2     7     5

In [30]:
df.index=["a","b","c","d","e"]

In [32]:
df[0:2]

   var1  var2  var3
a     6     7     4
b     8     2     0

In [29]:
# dilete

In [ ]:
df.drop("a",axis=0,inplace=True)

In [47]:
df

   var1  var2  var3
b     8     2     0
c     4     4     9
d     6     9     1
e     2     7     5

In [37]:
l=["c","e"]
df.drop(l,axis=0)

   var1  var2  var3
b     8     2     0
d     6     9     1

In [38]:
l=["var1","var2","var4","var3"]

In [40]:
for i in l:
    print(i in df)

True
True
False
True

In [41]:
df

   var1  var2  var3
b     8     2     0
c     4     4     9
d     6     9     1
e     2     7     5

In [48]:
df["var4"]=df["var2"]*df["var2"]

In [49]:
df

   var1  var2  var3  var4
b     8     2     0     4
c     4     4     9    16
d     6     9     1    81
e     2     7     5    49

In [50]:
df.drop("var4",axis=1)

   var1  var2  var3
b     8     2     0
c     4     4     9
d     6     9     1
e     2     7     5

In [51]:
df

   var1  var2  var3  var4
b     8     2     0     4
c     4     4     9    16
d     6     9     1    81
e     2     7     5    49

In [52]:
df.drop("var4",axis=1, inplace=True)

In [53]:
df

   var1  var2  var3
b     8     2     0
c     4     4     9
d     6     9     1
e     2     7     5